#map = affine_map<(d0) -> (d0)>
#map1 = affine_map<(d0, d1, d2) -> (d0, d1)>
#map2 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
#map3 = affine_map<(d0, d1, d2) -> (0, d1, d2)>
#map4 = affine_map<(d0, d1, d2) -> (d0, d1, 0)>
#map5 = affine_map<(d0, d1, d2) -> (0, d1, 0)>
#map6 = affine_map<(d0, d1, d2) -> (d2)>
#map7 = affine_map<(d0, d1) -> (d1)>
#map8 = affine_map<(d0, d1) -> (d0, d1)>
#map9 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
#map10 = affine_map<(d0, d1, d2, d3) -> (d0, d2, d1, d3)>
#map11 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d3, d2)>
#map12 = affine_map<() -> ()>
#map13 = affine_map<(d0, d1, d2, d3) -> (0, d1, d2, d3)>
#map14 = affine_map<(d0, d1, d2, d3) -> ()>
#map15 = affine_map<(d0, d1, d2, d3) -> (0, 0, d2, d3)>
#map16 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, 0)>
#map17 = affine_map<(d0, d1, d2, d3) -> (0, d1, d2, 0)>
#map18 = affine_map<(d0, d1) -> (d1, d0)>
module attributes {torch.debug_module_name = "_lambda"} {
  ml_program.global private mutable @global_seed(dense<0> : tensor<i64>) : tensor<i64>
  func.func @forward(%arg0: tensor<1x5xi64>) -> tensor<1x5x50257xf32> {
    %cst = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_0 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_1 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_2 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_3 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_4 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_5 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_6 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_7 = arith.constant dense_resource<__elided__> : tensor<768x768xf32>
    %cst_8 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_9 = arith.constant dense_resource<__elided__> : tensor<768x2304xf32>
    %cst_10 = arith.constant dense_resource<__elided__> : tensor<2304xf32>
    %cst_11 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_12 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_13 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_14 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_15 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_16 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_17 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_18 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_19 = arith.constant dense_resource<__elided__> : tensor<768x768xf32>
    %cst_20 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_21 = arith.constant dense_resource<__elided__> : tensor<768x2304xf32>
    %cst_22 = arith.constant dense_resource<__elided__> : tensor<2304xf32>
    %cst_23 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_24 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_25 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_26 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_27 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_28 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_29 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_30 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_31 = arith.constant dense_resource<__elided__> : tensor<768x768xf32>
    %cst_32 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_33 = arith.constant dense_resource<__elided__> : tensor<768x2304xf32>
    %cst_34 = arith.constant dense_resource<__elided__> : tensor<2304xf32>
    %cst_35 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_36 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_37 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_38 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_39 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_40 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_41 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_42 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_43 = arith.constant dense_resource<__elided__> : tensor<768x768xf32>
    %cst_44 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_45 = arith.constant dense_resource<__elided__> : tensor<768x2304xf32>
    %cst_46 = arith.constant dense_resource<__elided__> : tensor<2304xf32>
    %cst_47 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_48 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_49 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_50 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_51 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_52 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_53 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_54 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_55 = arith.constant dense_resource<__elided__> : tensor<768x768xf32>
    %cst_56 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_57 = arith.constant dense_resource<__elided__> : tensor<768x2304xf32>
    %cst_58 = arith.constant dense_resource<__elided__> : tensor<2304xf32>
    %cst_59 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_60 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_61 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_62 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_63 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_64 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_65 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_66 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_67 = arith.constant dense_resource<__elided__> : tensor<768x768xf32>
    %cst_68 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_69 = arith.constant dense_resource<__elided__> : tensor<768x2304xf32>
    %cst_70 = arith.constant dense_resource<__elided__> : tensor<2304xf32>
    %cst_71 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_72 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_73 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_74 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_75 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_76 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_77 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_78 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_79 = arith.constant dense_resource<__elided__> : tensor<768x768xf32>
    %cst_80 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_81 = arith.constant dense_resource<__elided__> : tensor<768x2304xf32>
    %cst_82 = arith.constant dense_resource<__elided__> : tensor<2304xf32>
    %cst_83 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_84 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_85 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_86 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_87 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_88 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_89 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_90 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_91 = arith.constant dense_resource<__elided__> : tensor<768x768xf32>
    %cst_92 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_93 = arith.constant dense_resource<__elided__> : tensor<768x2304xf32>
    %cst_94 = arith.constant dense_resource<__elided__> : tensor<2304xf32>
    %cst_95 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_96 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_97 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_98 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_99 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_100 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_101 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_102 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_103 = arith.constant dense_resource<__elided__> : tensor<768x768xf32>
    %cst_104 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_105 = arith.constant dense_resource<__elided__> : tensor<768x2304xf32>
    %cst_106 = arith.constant dense_resource<__elided__> : tensor<2304xf32>
    %cst_107 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_108 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_109 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_110 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_111 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_112 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_113 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_114 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_115 = arith.constant dense_resource<__elided__> : tensor<768x768xf32>
    %cst_116 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_117 = arith.constant dense_resource<__elided__> : tensor<768x2304xf32>
    %cst_118 = arith.constant dense_resource<__elided__> : tensor<2304xf32>
    %cst_119 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_120 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_121 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_122 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_123 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_124 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_125 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_126 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_127 = arith.constant dense_resource<__elided__> : tensor<768x768xf32>
    %cst_128 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_129 = arith.constant dense_resource<__elided__> : tensor<768x2304xf32>
    %cst_130 = arith.constant dense_resource<__elided__> : tensor<2304xf32>
    %cst_131 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_132 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_133 = arith.constant dense_resource<__elided__> : tensor<3072x768xf32>
    %cst_134 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_135 = arith.constant dense_resource<__elided__> : tensor<768x3072xf32>
    %cst_136 = arith.constant dense_resource<__elided__> : tensor<3072xf32>
    %cst_137 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_138 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_139 = arith.constant dense_resource<__elided__> : tensor<768x768xf32>
    %cst_140 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_141 = arith.constant dense_resource<__elided__> : tensor<1x1x1024x1024xi1>
    %cst_142 = arith.constant dense_resource<__elided__> : tensor<768x2304xf32>
    %cst_143 = arith.constant dense_resource<__elided__> : tensor<2304xf32>
    %cst_144 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_145 = arith.constant dense_resource<__elided__> : tensor<768xf32>
    %cst_146 = arith.constant dense_resource<__elided__> : tensor<1024x768xf32>
    %cst_147 = arith.constant dense_resource<__elided__> : tensor<50257x768xf32>
    %c50257 = arith.constant 50257 : index
    %c1024 = arith.constant 1024 : index
    %cst_148 = arith.constant 0.000000e+00 : f32
    %cst_149 = arith.constant 0xFF800000 : f32
    %c0_i64 = arith.constant 0 : i64
    %cst_150 = arith.constant -3.4028234663852886E+38 : f64
    %cst_151 = arith.constant 1.000000e-05 : f64
    %cst_152 = arith.constant 8.000000e+00 : f64
    %cst_153 = arith.constant 4.471500e-02 : f64
    %cst_154 = arith.constant 0.79788456080286541 : f64
    %cst_155 = arith.constant 7.680000e+02 : f32
    %cst_156 = arith.constant 5.000000e-01 : f32
    %cst_157 = arith.constant 3.000000e+00 : f32
    %cst_158 = arith.constant 1.000000e+00 : f32
    %0 = tensor.empty() : tensor<5xi64>
    %1 = linalg.generic {indexing_maps = [#map], iterator_types = ["parallel"]} outs(%0 : tensor<5xi64>) {
    ^bb0(%out: i64):
      %760 = linalg.index 0 : index
      %761 = arith.index_cast %760 : index to i64
      linalg.yield %761 : i64
    } -> tensor<5xi64>
    %expanded = tensor.expand_shape %1 [[0, 1]] : tensor<5xi64> into tensor<1x5xi64>
    %2 = tensor.empty() : tensor<1x5x768xf32>
    %3 = linalg.generic {indexing_maps = [#map1, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%arg0 : tensor<1x5xi64>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: i64, %out: f32):
      %760 = arith.index_cast %in : i64 to index
      %761 = linalg.index 2 : index
      %762 = arith.cmpi slt, %760, %c50257 : index
      cf.assert %762, "index must be smaller than dim size"
      %763 = arith.cmpi sge, %in, %c0_i64 : i64
      cf.assert %763, "index must be larger or equal to 0"
      %extracted = tensor.extract %cst_147[%760, %761] : tensor<50257x768xf32>
      linalg.yield %extracted : f32
    } -> tensor<1x5x768xf32>
    %4 = linalg.generic {indexing_maps = [#map1, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%expanded : tensor<1x5xi64>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: i64, %out: f32):
      %760 = arith.index_cast %in : i64 to index
      %761 = linalg.index 2 : index
      %762 = arith.cmpi slt, %760, %c1024 : index
      cf.assert %762, "index must be smaller than dim size"
      %763 = arith.cmpi sge, %in, %c0_i64 : i64
      cf.assert %763, "index must be larger or equal to 0"
      %extracted = tensor.extract %cst_146[%760, %761] : tensor<1024x768xf32>
      linalg.yield %extracted : f32
    } -> tensor<1x5x768xf32>
    %5 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%3, %4 : tensor<1x5x768xf32>, tensor<1x5x768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.addf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %6 = tensor.empty() : tensor<1x5x1xf32>
    %7 = linalg.fill ins(%cst_148 : f32) outs(%6 : tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %8 = linalg.generic {indexing_maps = [#map2, #map4], iterator_types = ["parallel", "parallel", "reduction"]} ins(%5 : tensor<1x5x768xf32>) outs(%7 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.addf %in, %out : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %9 = linalg.generic {indexing_maps = [#map5, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%8 : tensor<1x5x1xf32>) outs(%6 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.divf %in, %cst_155 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %10 = linalg.generic {indexing_maps = [#map4, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%9 : tensor<1x5x1xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x5x768xf32>
    %11 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%5, %10 : tensor<1x5x768xf32>, tensor<1x5x768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.subf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %12 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%11, %11 : tensor<1x5x768xf32>, tensor<1x5x768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.mulf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %13 = linalg.generic {indexing_maps = [#map2, #map4], iterator_types = ["parallel", "parallel", "reduction"]} ins(%12 : tensor<1x5x768xf32>) outs(%7 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.addf %in, %out : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %14 = linalg.generic {indexing_maps = [#map5, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%13 : tensor<1x5x1xf32>) outs(%6 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.divf %in, %cst_155 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %15 = linalg.generic {indexing_maps = [#map5, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%14 : tensor<1x5x1xf32>) outs(%6 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.truncf %cst_151 : f64 to f32
      %761 = arith.addf %in, %760 : f32
      linalg.yield %761 : f32
    } -> tensor<1x5x1xf32>
    %16 = linalg.generic {indexing_maps = [#map5, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%15 : tensor<1x5x1xf32>) outs(%6 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = math.rsqrt %in : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %17 = linalg.generic {indexing_maps = [#map4, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%16 : tensor<1x5x1xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x5x768xf32>
    %18 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%11, %17 : tensor<1x5x768xf32>, tensor<1x5x768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.mulf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %19 = linalg.generic {indexing_maps = [#map3, #map6, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%18, %cst_145 : tensor<1x5x768xf32>, tensor<768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.mulf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %20 = linalg.generic {indexing_maps = [#map3, #map6, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%19, %cst_144 : tensor<1x5x768xf32>, tensor<768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.addf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %collapsed = tensor.collapse_shape %20 [[0, 1], [2]] : tensor<1x5x768xf32> into tensor<5x768xf32>
    %21 = tensor.empty() : tensor<5x2304xf32>
    %22 = linalg.fill ins(%cst_148 : f32) outs(%21 : tensor<5x2304xf32>) -> tensor<5x2304xf32>
    %23 = linalg.matmul ins(%collapsed, %cst_142 : tensor<5x768xf32>, tensor<768x2304xf32>) outs(%22 : tensor<5x2304xf32>) -> tensor<5x2304xf32>
    %24 = linalg.generic {indexing_maps = [#map7, #map8, #map8], iterator_types = ["parallel", "parallel"]} ins(%cst_143, %23 : tensor<2304xf32>, tensor<5x2304xf32>) outs(%21 : tensor<5x2304xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.addf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<5x2304xf32>
    %expanded_159 = tensor.expand_shape %24 [[0, 1], [2]] : tensor<5x2304xf32> into tensor<1x5x2304xf32>
    %extracted_slice = tensor.extract_slice %expanded_159[0, 0, 0] [1, 5, 768] [1, 1, 1] : tensor<1x5x2304xf32> to tensor<1x5x768xf32>
    %extracted_slice_160 = tensor.extract_slice %expanded_159[0, 0, 768] [1, 5, 768] [1, 1, 1] : tensor<1x5x2304xf32> to tensor<1x5x768xf32>
    %extracted_slice_161 = tensor.extract_slice %expanded_159[0, 0, 1536] [1, 5, 768] [1, 1, 1] : tensor<1x5x2304xf32> to tensor<1x5x768xf32>
    %expanded_162 = tensor.expand_shape %extracted_slice [[0], [1], [2, 3]] : tensor<1x5x768xf32> into tensor<1x5x12x64xf32>
    %25 = tensor.empty() : tensor<1x12x5x64xf32>
    %26 = linalg.generic {indexing_maps = [#map9, #map10], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded_162 : tensor<1x5x12x64xf32>) outs(%25 : tensor<1x12x5x64xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x12x5x64xf32>
    %expanded_163 = tensor.expand_shape %extracted_slice_160 [[0], [1], [2, 3]] : tensor<1x5x768xf32> into tensor<1x5x12x64xf32>
    %27 = linalg.generic {indexing_maps = [#map9, #map10], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded_163 : tensor<1x5x12x64xf32>) outs(%25 : tensor<1x12x5x64xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x12x5x64xf32>
    %expanded_164 = tensor.expand_shape %extracted_slice_161 [[0], [1], [2, 3]] : tensor<1x5x768xf32> into tensor<1x5x12x64xf32>
    %28 = linalg.generic {indexing_maps = [#map9, #map10], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded_164 : tensor<1x5x12x64xf32>) outs(%25 : tensor<1x12x5x64xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x12x5x64xf32>
    %29 = tensor.empty() : tensor<1x12x64x5xf32>
    %30 = linalg.generic {indexing_maps = [#map9, #map11], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%27 : tensor<1x12x5x64xf32>) outs(%29 : tensor<1x12x64x5xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x12x64x5xf32>
    %collapsed_165 = tensor.collapse_shape %26 [[0, 1], [2], [3]] : tensor<1x12x5x64xf32> into tensor<12x5x64xf32>
    %collapsed_166 = tensor.collapse_shape %30 [[0, 1], [2], [3]] : tensor<1x12x64x5xf32> into tensor<12x64x5xf32>
    %31 = tensor.empty() : tensor<12x5x5xf32>
    %32 = linalg.fill ins(%cst_148 : f32) outs(%31 : tensor<12x5x5xf32>) -> tensor<12x5x5xf32>
    %33 = linalg.batch_matmul ins(%collapsed_165, %collapsed_166 : tensor<12x5x64xf32>, tensor<12x64x5xf32>) outs(%32 : tensor<12x5x5xf32>) -> tensor<12x5x5xf32>
    %expanded_167 = tensor.expand_shape %33 [[0, 1], [2], [3]] : tensor<12x5x5xf32> into tensor<1x12x5x5xf32>
    %34 = tensor.empty() : tensor<f64>
    %35 = linalg.fill ins(%cst_152 : f64) outs(%34 : tensor<f64>) -> tensor<f64>
    %36 = tensor.empty() : tensor<f32>
    %37 = linalg.generic {indexing_maps = [#map12, #map12], iterator_types = []} ins(%35 : tensor<f64>) outs(%36 : tensor<f32>) {
    ^bb0(%in: f64, %out: f32):
      %760 = arith.truncf %in : f64 to f32
      linalg.yield %760 : f32
    } -> tensor<f32>
    %38 = tensor.empty() : tensor<1x12x5x5xf32>
    %39 = linalg.generic {indexing_maps = [#map13, #map14, #map9], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded_167, %37 : tensor<1x12x5x5xf32>, tensor<f32>) outs(%38 : tensor<1x12x5x5xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.divf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x12x5x5xf32>
    %extracted_slice_168 = tensor.extract_slice %cst_141[0, 0, 0, 0] [1, 1, 5, 1024] [1, 1, 1, 1] : tensor<1x1x1024x1024xi1> to tensor<1x1x5x1024xi1>
    %extracted_slice_169 = tensor.extract_slice %extracted_slice_168[0, 0, 0, 0] [1, 1, 5, 5] [1, 1, 1, 1] : tensor<1x1x5x1024xi1> to tensor<1x1x5x5xi1>
    %40 = linalg.fill ins(%cst_150 : f64) outs(%34 : tensor<f64>) -> tensor<f64>
    %41 = linalg.generic {indexing_maps = [#map12, #map12], iterator_types = []} ins(%40 : tensor<f64>) outs(%36 : tensor<f32>) {
    ^bb0(%in: f64, %out: f32):
      %760 = arith.truncf %in : f64 to f32
      linalg.yield %760 : f32
    } -> tensor<f32>
    %42 = linalg.generic {indexing_maps = [#map15, #map13, #map14, #map9], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%extracted_slice_169, %39, %41 : tensor<1x1x5x5xi1>, tensor<1x12x5x5xf32>, tensor<f32>) outs(%38 : tensor<1x12x5x5xf32>) {
    ^bb0(%in: i1, %in_401: f32, %in_402: f32, %out: f32):
      %760 = arith.select %in, %in_401, %in_402 : f32
      linalg.yield %760 : f32
    } -> tensor<1x12x5x5xf32>
    %43 = tensor.empty() : tensor<1x12x5x1xi64>
    %44 = linalg.fill ins(%c0_i64 : i64) outs(%43 : tensor<1x12x5x1xi64>) -> tensor<1x12x5x1xi64>
    %45 = tensor.empty() : tensor<1x12x5x1xf32>
    %46 = linalg.fill ins(%cst_149 : f32) outs(%45 : tensor<1x12x5x1xf32>) -> tensor<1x12x5x1xf32>
    %47:2 = linalg.generic {indexing_maps = [#map9, #map16, #map16], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%42 : tensor<1x12x5x5xf32>) outs(%46, %44 : tensor<1x12x5x1xf32>, tensor<1x12x5x1xi64>) {
    ^bb0(%in: f32, %out: f32, %out_401: i64):
      %760 = linalg.index 3 : index
      %761 = arith.index_cast %760 : index to i64
      %762 = arith.maximumf %in, %out : f32
      %763 = arith.cmpf ogt, %in, %out : f32
      %764 = arith.select %763, %761, %out_401 : i64
      linalg.yield %762, %764 : f32, i64
    } -> (tensor<1x12x5x1xf32>, tensor<1x12x5x1xi64>)
    %48 = linalg.generic {indexing_maps = [#map13, #map17, #map9], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%42, %47#0 : tensor<1x12x5x5xf32>, tensor<1x12x5x1xf32>) outs(%38 : tensor<1x12x5x5xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.subf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x12x5x5xf32>
    %49 = linalg.generic {indexing_maps = [#map13, #map9], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%48 : tensor<1x12x5x5xf32>) outs(%38 : tensor<1x12x5x5xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = math.exp %in : f32
      linalg.yield %760 : f32
    } -> tensor<1x12x5x5xf32>
    %50 = linalg.fill ins(%cst_148 : f32) outs(%45 : tensor<1x12x5x1xf32>) -> tensor<1x12x5x1xf32>
    %51 = linalg.generic {indexing_maps = [#map9, #map16], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%49 : tensor<1x12x5x5xf32>) outs(%50 : tensor<1x12x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.addf %in, %out : f32
      linalg.yield %760 : f32
    } -> tensor<1x12x5x1xf32>
    %52 = linalg.generic {indexing_maps = [#map13, #map17, #map9], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%49, %51 : tensor<1x12x5x5xf32>, tensor<1x12x5x1xf32>) outs(%38 : tensor<1x12x5x5xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.divf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x12x5x5xf32>
    %collapsed_170 = tensor.collapse_shape %52 [[0, 1], [2], [3]] : tensor<1x12x5x5xf32> into tensor<12x5x5xf32>
    %collapsed_171 = tensor.collapse_shape %28 [[0, 1], [2], [3]] : tensor<1x12x5x64xf32> into tensor<12x5x64xf32>
    %53 = tensor.empty() : tensor<12x5x64xf32>
    %54 = linalg.fill ins(%cst_148 : f32) outs(%53 : tensor<12x5x64xf32>) -> tensor<12x5x64xf32>
    %55 = linalg.batch_matmul ins(%collapsed_170, %collapsed_171 : tensor<12x5x5xf32>, tensor<12x5x64xf32>) outs(%54 : tensor<12x5x64xf32>) -> tensor<12x5x64xf32>
    %expanded_172 = tensor.expand_shape %55 [[0, 1], [2], [3]] : tensor<12x5x64xf32> into tensor<1x12x5x64xf32>
    %56 = tensor.empty() : tensor<1x5x12x64xf32>
    %57 = linalg.generic {indexing_maps = [#map9, #map10], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded_172 : tensor<1x12x5x64xf32>) outs(%56 : tensor<1x5x12x64xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x5x12x64xf32>
    %58 = linalg.generic {indexing_maps = [#map13, #map9], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%57 : tensor<1x5x12x64xf32>) outs(%56 : tensor<1x5x12x64xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x5x12x64xf32>
    %collapsed_173 = tensor.collapse_shape %58 [[0, 1], [2, 3]] : tensor<1x5x12x64xf32> into tensor<5x768xf32>
    %59 = tensor.empty() : tensor<5x768xf32>
    %60 = linalg.fill ins(%cst_148 : f32) outs(%59 : tensor<5x768xf32>) -> tensor<5x768xf32>
    %61 = linalg.matmul ins(%collapsed_173, %cst_139 : tensor<5x768xf32>, tensor<768x768xf32>) outs(%60 : tensor<5x768xf32>) -> tensor<5x768xf32>
    %62 = linalg.generic {indexing_maps = [#map7, #map8, #map8], iterator_types = ["parallel", "parallel"]} ins(%cst_140, %61 : tensor<768xf32>, tensor<5x768xf32>) outs(%59 : tensor<5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.addf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<5x768xf32>
    %expanded_174 = tensor.expand_shape %62 [[0, 1], [2]] : tensor<5x768xf32> into tensor<1x5x768xf32>
    %63 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%expanded_174, %5 : tensor<1x5x768xf32>, tensor<1x5x768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.addf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %64 = linalg.generic {indexing_maps = [#map2, #map4], iterator_types = ["parallel", "parallel", "reduction"]} ins(%63 : tensor<1x5x768xf32>) outs(%7 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.addf %in, %out : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %65 = linalg.generic {indexing_maps = [#map5, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%64 : tensor<1x5x1xf32>) outs(%6 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.divf %in, %cst_155 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %66 = linalg.generic {indexing_maps = [#map4, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%65 : tensor<1x5x1xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x5x768xf32>
    %67 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%63, %66 : tensor<1x5x768xf32>, tensor<1x5x768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.subf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %68 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%67, %67 : tensor<1x5x768xf32>, tensor<1x5x768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.mulf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %69 = linalg.generic {indexing_maps = [#map2, #map4], iterator_types = ["parallel", "parallel", "reduction"]} ins(%68 : tensor<1x5x768xf32>) outs(%7 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.addf %in, %out : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %70 = linalg.generic {indexing_maps = [#map5, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%69 : tensor<1x5x1xf32>) outs(%6 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.divf %in, %cst_155 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %71 = linalg.generic {indexing_maps = [#map5, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%70 : tensor<1x5x1xf32>) outs(%6 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.truncf %cst_151 : f64 to f32
      %761 = arith.addf %in, %760 : f32
      linalg.yield %761 : f32
    } -> tensor<1x5x1xf32>
    %72 = linalg.generic {indexing_maps = [#map5, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%71 : tensor<1x5x1xf32>) outs(%6 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = math.rsqrt %in : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %73 = linalg.generic {indexing_maps = [#map4, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%72 : tensor<1x5x1xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x5x768xf32>
    %74 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%67, %73 : tensor<1x5x768xf32>, tensor<1x5x768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.mulf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %75 = linalg.generic {indexing_maps = [#map3, #map6, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%74, %cst_138 : tensor<1x5x768xf32>, tensor<768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.mulf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %76 = linalg.generic {indexing_maps = [#map3, #map6, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%75, %cst_137 : tensor<1x5x768xf32>, tensor<768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.addf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %collapsed_175 = tensor.collapse_shape %76 [[0, 1], [2]] : tensor<1x5x768xf32> into tensor<5x768xf32>
    %77 = tensor.empty() : tensor<5x3072xf32>
    %78 = linalg.fill ins(%cst_148 : f32) outs(%77 : tensor<5x3072xf32>) -> tensor<5x3072xf32>
    %79 = linalg.matmul ins(%collapsed_175, %cst_135 : tensor<5x768xf32>, tensor<768x3072xf32>) outs(%78 : tensor<5x3072xf32>) -> tensor<5x3072xf32>
    %80 = linalg.generic {indexing_maps = [#map7, #map8, #map8], iterator_types = ["parallel", "parallel"]} ins(%cst_136, %79 : tensor<3072xf32>, tensor<5x3072xf32>) outs(%77 : tensor<5x3072xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.addf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<5x3072xf32>
    %expanded_176 = tensor.expand_shape %80 [[0, 1], [2]] : tensor<5x3072xf32> into tensor<1x5x3072xf32>
    %81 = tensor.empty() : tensor<1x5x3072xf32>
    %82 = linalg.generic {indexing_maps = [#map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%expanded_176 : tensor<1x5x3072xf32>) outs(%81 : tensor<1x5x3072xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.mulf %in, %cst_156 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x3072xf32>
    %83 = linalg.generic {indexing_maps = [#map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%expanded_176 : tensor<1x5x3072xf32>) outs(%81 : tensor<1x5x3072xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = math.powf %in, %cst_157 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x3072xf32>
    %84 = linalg.generic {indexing_maps = [#map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%83 : tensor<1x5x3072xf32>) outs(%81 : tensor<1x5x3072xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.truncf %cst_153 : f64 to f32
      %761 = arith.mulf %in, %760 : f32
      linalg.yield %761 : f32
    } -> tensor<1x5x3072xf32>
    %85 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%expanded_176, %84 : tensor<1x5x3072xf32>, tensor<1x5x3072xf32>) outs(%81 : tensor<1x5x3072xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.addf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x3072xf32>
    %86 = linalg.generic {indexing_maps = [#map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%85 : tensor<1x5x3072xf32>) outs(%81 : tensor<1x5x3072xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.truncf %cst_154 : f64 to f32
      %761 = arith.mulf %in, %760 : f32
      linalg.yield %761 : f32
    } -> tensor<1x5x3072xf32>
    %87 = linalg.generic {indexing_maps = [#map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%86 : tensor<1x5x3072xf32>) outs(%81 : tensor<1x5x3072xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = math.tanh %in : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x3072xf32>
    %88 = linalg.generic {indexing_maps = [#map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%87 : tensor<1x5x3072xf32>) outs(%81 : tensor<1x5x3072xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.addf %in, %cst_158 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x3072xf32>
    %89 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%82, %88 : tensor<1x5x3072xf32>, tensor<1x5x3072xf32>) outs(%81 : tensor<1x5x3072xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.mulf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x3072xf32>
    %collapsed_177 = tensor.collapse_shape %89 [[0, 1], [2]] : tensor<1x5x3072xf32> into tensor<5x3072xf32>
    %90 = linalg.matmul ins(%collapsed_177, %cst_133 : tensor<5x3072xf32>, tensor<3072x768xf32>) outs(%60 : tensor<5x768xf32>) -> tensor<5x768xf32>
    %91 = linalg.generic {indexing_maps = [#map7, #map8, #map8], iterator_types = ["parallel", "parallel"]} ins(%cst_134, %90 : tensor<768xf32>, tensor<5x768xf32>) outs(%59 : tensor<5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.addf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<5x768xf32>
    %expanded_178 = tensor.expand_shape %91 [[0, 1], [2]] : tensor<5x768xf32> into tensor<1x5x768xf32>
    %92 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%63, %expanded_178 : tensor<1x5x768xf32>, tensor<1x5x768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.addf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %93 = linalg.generic {indexing_maps = [#map2, #map4], iterator_types = ["parallel", "parallel", "reduction"]} ins(%92 : tensor<1x5x768xf32>) outs(%7 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.addf %in, %out : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %94 = linalg.generic {indexing_maps = [#map5, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%93 : tensor<1x5x1xf32>) outs(%6 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.divf %in, %cst_155 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %95 = linalg.generic {indexing_maps = [#map4, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%94 : tensor<1x5x1xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x5x768xf32>
    %96 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%92, %95 : tensor<1x5x768xf32>, tensor<1x5x768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.subf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %97 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%96, %96 : tensor<1x5x768xf32>, tensor<1x5x768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.mulf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %98 = linalg.generic {indexing_maps = [#map2, #map4], iterator_types = ["parallel", "parallel", "reduction"]} ins(%97 : tensor<1x5x768xf32>) outs(%7 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.addf %in, %out : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %99 = linalg.generic {indexing_maps = [#map5, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%98 : tensor<1x5x1xf32>) outs(%6 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.divf %in, %cst_155 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %100 = linalg.generic {indexing_maps = [#map5, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%99 : tensor<1x5x1xf32>) outs(%6 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.truncf %cst_151 : f64 to f32
      %761 = arith.addf %in, %760 : f32
      linalg.yield %761 : f32
    } -> tensor<1x5x1xf32>
    %101 = linalg.generic {indexing_maps = [#map5, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%100 : tensor<1x5x1xf32>) outs(%6 : tensor<1x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = math.rsqrt %in : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x1xf32>
    %102 = linalg.generic {indexing_maps = [#map4, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%101 : tensor<1x5x1xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x5x768xf32>
    %103 = linalg.generic {indexing_maps = [#map3, #map3, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%96, %102 : tensor<1x5x768xf32>, tensor<1x5x768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.mulf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %104 = linalg.generic {indexing_maps = [#map3, #map6, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%103, %cst_132 : tensor<1x5x768xf32>, tensor<768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.mulf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %105 = linalg.generic {indexing_maps = [#map3, #map6, #map2], iterator_types = ["parallel", "parallel", "parallel"]} ins(%104, %cst_131 : tensor<1x5x768xf32>, tensor<768xf32>) outs(%2 : tensor<1x5x768xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.addf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x5x768xf32>
    %collapsed_179 = tensor.collapse_shape %105 [[0, 1], [2]] : tensor<1x5x768xf32> into tensor<5x768xf32>
    %106 = linalg.matmul ins(%collapsed_179, %cst_129 : tensor<5x768xf32>, tensor<768x2304xf32>) outs(%22 : tensor<5x2304xf32>) -> tensor<5x2304xf32>
    %107 = linalg.generic {indexing_maps = [#map7, #map8, #map8], iterator_types = ["parallel", "parallel"]} ins(%cst_130, %106 : tensor<2304xf32>, tensor<5x2304xf32>) outs(%21 : tensor<5x2304xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.addf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<5x2304xf32>
    %expanded_180 = tensor.expand_shape %107 [[0, 1], [2]] : tensor<5x2304xf32> into tensor<1x5x2304xf32>
    %extracted_slice_181 = tensor.extract_slice %expanded_180[0, 0, 0] [1, 5, 768] [1, 1, 1] : tensor<1x5x2304xf32> to tensor<1x5x768xf32>
    %extracted_slice_182 = tensor.extract_slice %expanded_180[0, 0, 768] [1, 5, 768] [1, 1, 1] : tensor<1x5x2304xf32> to tensor<1x5x768xf32>
    %extracted_slice_183 = tensor.extract_slice %expanded_180[0, 0, 1536] [1, 5, 768] [1, 1, 1] : tensor<1x5x2304xf32> to tensor<1x5x768xf32>
    %expanded_184 = tensor.expand_shape %extracted_slice_181 [[0], [1], [2, 3]] : tensor<1x5x768xf32> into tensor<1x5x12x64xf32>
    %108 = linalg.generic {indexing_maps = [#map9, #map10], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded_184 : tensor<1x5x12x64xf32>) outs(%25 : tensor<1x12x5x64xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x12x5x64xf32>
    %expanded_185 = tensor.expand_shape %extracted_slice_182 [[0], [1], [2, 3]] : tensor<1x5x768xf32> into tensor<1x5x12x64xf32>
    %109 = linalg.generic {indexing_maps = [#map9, #map10], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded_185 : tensor<1x5x12x64xf32>) outs(%25 : tensor<1x12x5x64xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x12x5x64xf32>
    %expanded_186 = tensor.expand_shape %extracted_slice_183 [[0], [1], [2, 3]] : tensor<1x5x768xf32> into tensor<1x5x12x64xf32>
    %110 = linalg.generic {indexing_maps = [#map9, #map10], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded_186 : tensor<1x5x12x64xf32>) outs(%25 : tensor<1x12x5x64xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x12x5x64xf32>
    %111 = linalg.generic {indexing_maps = [#map9, #map11], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%109 : tensor<1x12x5x64xf32>) outs(%29 : tensor<1x12x64x5xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x12x64x5xf32>
    %collapsed_187 = tensor.collapse_shape %108 [[0, 1], [2], [3]] : tensor<1x12x5x64xf32> into tensor<12x5x64xf32>
    %collapsed_188 = tensor.collapse_shape %111 [[0, 1], [2], [3]] : tensor<1x12x64x5xf32> into tensor<12x64x5xf32>
    %112 = linalg.batch_matmul ins(%collapsed_187, %collapsed_188 : tensor<12x5x64xf32>, tensor<12x64x5xf32>) outs(%32 : tensor<12x5x5xf32>) -> tensor<12x5x5xf32>
    %expanded_189 = tensor.expand_shape %112 [[0, 1], [2], [3]] : tensor<12x5x5xf32> into tensor<1x12x5x5xf32>
    %113 = linalg.generic {indexing_maps = [#map13, #map14, #map9], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded_189, %37 : tensor<1x12x5x5xf32>, tensor<f32>) outs(%38 : tensor<1x12x5x5xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.divf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x12x5x5xf32>
    %114 = linalg.generic {indexing_maps = [#map15, #map13, #map14, #map9], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%extracted_slice_169, %113, %41 : tensor<1x1x5x5xi1>, tensor<1x12x5x5xf32>, tensor<f32>) outs(%38 : tensor<1x12x5x5xf32>) {
    ^bb0(%in: i1, %in_401: f32, %in_402: f32, %out: f32):
      %760 = arith.select %in, %in_401, %in_402 : f32
      linalg.yield %760 : f32
    } -> tensor<1x12x5x5xf32>
    %115:2 = linalg.generic {indexing_maps = [#map9, #map16, #map16], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%114 : tensor<1x12x5x5xf32>) outs(%46, %44 : tensor<1x12x5x1xf32>, tensor<1x12x5x1xi64>) {
    ^bb0(%in: f32, %out: f32, %out_401: i64):
      %760 = linalg.index 3 : index
      %761 = arith.index_cast %760 : index to i64
      %762 = arith.maximumf %in, %out : f32
      %763 = arith.cmpf ogt, %in, %out : f32
      %764 = arith.select %763, %761, %out_401 : i64
      linalg.yield %762, %764 : f32, i64
    } -> (tensor<1x12x5x1xf32>, tensor<1x12x5x1xi64>)
    %116 = linalg.generic {indexing_maps = [#map13, #map17, #map9], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%114, %115#0 : tensor<1x12x5x5xf32>, tensor<1x12x5x1xf32>) outs(%38 : tensor<1x12x5x5xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.subf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x12x5x5xf32>
    %117 = linalg.generic {indexing_maps = [#map13, #map9], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%116 : tensor<1x12x5x5xf32>) outs(%38 : tensor<1x12x5x5xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = math.exp %in : f32
      linalg.yield %760 : f32
    } -> tensor<1x12x5x5xf32>
    %118 = linalg.generic {indexing_maps = [#map9, #map16], iterator_types = ["parallel", "parallel", "parallel", "reduction"]} ins(%117 : tensor<1x12x5x5xf32>) outs(%50 : tensor<1x12x5x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %760 = arith.addf %in, %out : f32
      linalg.yield %760 : f32
    } -> tensor<1x12x5x1xf32>
    %119 = linalg.generic {indexing_maps = [#map13, #map17, #map9], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%117, %118 : tensor<1x12x5x5xf32>, tensor<1x12x5x1xf32>) outs(%38 : tensor<1x12x5x5xf32>) {
    ^bb0(%in: f32, %in_401: f32, %out: f32):
      %760 = arith.divf %in, %in_401 : f32
      linalg.yield %760 : f32
    } -> tensor<1x12x5x5xf32>
    %collapsed_190 = tensor.collapse_shape %119 [[0, 1], [2], [3]] : tensor<1x12x5x5xf32> into tensor<12x5x5xf32>
    %collapsed_191 = tensor.collapse_shape %110 [[0, 1], [2], [3]] : tensor<1x12x5x64xf32> into tensor<12x5x64xf32>
    %120 = linalg.batch_matmul ins(%collapsed_190, %collapsed_191 : tensor<12x5x5xf32>, tensor<12x5x64xf32>) outs(%54 : tensor<12x5x64xf32>) -> tensor<12x5x64xf32>
    %expanded_192 = tensor.expand_shape %120 [[0, 1], [2], [3]] : tensor<12x5x64xf32> into tensor<1x12x5x64xf32>
    %121 = linalg.generic {indexing_maps = [#map9, #map10], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%expanded_192 : tensor<1x12x5x64xf32>) outs(%56 : tensor<1x5x12x64xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x5x12x64xf32>
    %122 = linalg.generic {indexing_maps = [#map13, #map9], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%121 : tensor<1x5x12x64xf32>) outs(%56 : tensor<1x5x12x64xf32>) {
    ^bb0(%in: f32, %out: f32):
